# loc & iloc function

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("train.csv")
df

  12  Unnamed: 1  train no     ID Name   aa   we we.1
0  a         NaN       0.0  123.0  all    s  sds    s
1  b         NaN       1.0   45.0   ka  NaN  sds   sd
2  c         NaN       NaN   32.0   we   sd  sds  NaN
3  d         NaN       NaN    NaN  NaN  NaN  NaN  NaN

In [7]:
df.loc[2]

12               c
Unnamed: 1     NaN
train no       NaN
ID            32.0
Name            we
aa              sd
we             sds
we.1           NaN
Name: 2, dtype: object

In [8]:
df.loc[[1,2]]

  12  Unnamed: 1  train no    ID Name   aa   we we.1
1  b         NaN       1.0  45.0   ka  NaN  sds   sd
2  c         NaN       NaN  32.0   we   sd  sds  NaN

In [9]:
df.loc[2,'ID']

32.0

In [10]:
df.loc[0:2,"ID"]

0    123.0
1     45.0
2     32.0
Name: ID, dtype: float64

In [12]:
df.loc[df['ID']<411]

  12  Unnamed: 1  train no     ID Name   aa   we we.1
0  a         NaN       0.0  123.0  all    s  sds    s
1  b         NaN       1.0   45.0   ka  NaN  sds   sd
2  c         NaN       NaN   32.0   we   sd  sds  NaN

In [13]:
df.loc[df['ID']<46]

  12  Unnamed: 1  train no    ID Name   aa   we we.1
1  b         NaN       1.0  45.0   ka  NaN  sds   sd
2  c         NaN       NaN  32.0   we   sd  sds  NaN

# iloc func

In [17]:
df.iloc[[0]]

  12  Unnamed: 1  train no     ID Name aa   we we.1
0  a         NaN       0.0  123.0  all  s  sds    s

In [21]:
df.iloc[1:4,0]

1    b
2    c
3    d
Name: 12, dtype: object

In [24]:
df.iloc[[0,1]]

  12  Unnamed: 1  train no     ID Name   aa   we we.1
0  a         NaN       0.0  123.0  all    s  sds    s
1  b         NaN       1.0   45.0   ka  NaN  sds   sd

In [40]:
df.iloc[[1,3]]

AttributeError: 'int' object has no attribute 'iloc'

In [38]:
df.iloc[0]

AttributeError: 'int' object has no attribute 'iloc'